# TODO  Напишите функцию count_letters
def count_letters(str):
    list1 = []
    for i in str:
        t = i.lower()
        if i.isalpha():
            list1.append(t)
    clw = {}
    for i in list1:
        if i not in clw:
            clw[i] = list1.count(i)


    return clw


# TODO Напишите функцию calculate_frequency
def calculate_frequency(clowar, str):
    list1 = []
    for i in str:
        t = i.lower()
        if i.isalpha():
            list1.append(t)
    list_len= len(list1)
    for x, y in clowar.items():
        clowar[x] = round(y/list_len, 2)
    return clowar

main_str = """
У лукоморья дуб зелёный;
Златая цепь на дубе том:
И днём и ночью кот учёный
Всё ходит по цепи кругом;
Идёт направо — песнь заводит,
Налево — сказку говорит.
Там чудеса: там леший бродит,
Русалка на ветвях сидит;
Там на неведомых дорожках
Следы невиданных зверей;
Избушка там на курьих ножках
Стоит без окон, без дверей;
Там лес и дол видений полны;
Там о заре прихлынут волны
На брег песчаный и пустой,
И тридцать витязей прекрасных
Чредой из вод выходят ясных,
И с ними дядька их морской;
Там королевич мимоходом
Пленяет грозного царя;
Там в облаках перед народом
Через леса, через моря
Колдун несёт богатыря;
В темнице там царевна тужит,
А бурый волк ей верно служит;
Там ступа с Бабою Ягой
Идёт, бредёт сама собой,
Там царь Кащей над златом чахнет;
Там русский дух… там Русью пахнет!
И там я был, и мёд я пил;
У моря видел дуб зелёный;
Под ним сидел, и кот учёный
Свои мне сказки говорил.
"""

# TODO Распечатайте в столбик букву и её частоту в тексте
list_count = count_letters(main_str)
list_otnoch = calculate_frequency(list_count, main_str)
for x, y in list_otnoch.items():
    t = f"{y:.2f}"
    print(x, ": ", t, sep = '')
